<script setup lang="ts">

</script>

<template>
  <main>
    <center>
      <h1 class="title-cn">Добро пожаловать на домашнюю страницу NBDatsuya!</h1>
      <img alt="my-portrait" src="https://avatars.githubusercontent.com/u/92795619?v=4" width="270"/>
    </center>
    <p>
      Привет всем 👋 Я — NBDatsuya. Я ученик в сфере «игрушечных» систем, занимаюсь веб-фронтендом и разработкой игр,
      а также немного разбираюсь в бэкенде. В настоящее время
      я работаю в компании среднего размера, исследую и изучаю разработку игр,
      стремясь в конечном итоге самостоятельно создавать инди-игры.
    </p>
    <p>
      🌱 Vue.js 3, Golang, Springboot
    </p>
    <p>
      😄 Я НЕ участвую в западной гендерной политике. Я — МУЖЧИНА с НОРМАЛЬНОЙ сексуальной ориентацией. (он/его)
    </p>
    <p>
      🏙 В настоящее время я нахожусь в Шэньчжэне — городе, который ценит искусство типологии/классификации.
    </p>

    <ul>
      <li>
        <a>DDataComponent (На основе UI PrimeVue)</a>
        <span>: Набор готовых к использованию компонентов, включая диалоговые окна, таблицы данных, детали данных и поля поиска данных, быстро созданных на основе существующих библиотек компонентов для удовлетворения моих потребностей в разработке с 2023 по 2025 год.</span>
      </li>
      <li>
        <a>The Frontroom</a>
        <span>: Отсылка к The Backrooms. Это простая многопользовательская боевая игра, где игроки сталкиваются друг с другом; выбывание определяется по критерию столкновения, и победителем становится последний выживший.</span>
      </li>
      <li>
        <a>SNAMC</a>
      </li>
    </ul>
  </main>
</template>

<style scoped>

</style>